#include <iostream>

int main() {

    std::cout << 2026 << "\n";

    std::cout << 2004 + 22 << "\n";
    // 足し算: 2026
    std::cout << 2026 - 22 << "\n";
    // 引き算: 2004
    std::cout << 1013 * 2 << "\n";
    // 掛け算: 2026
    std::cout << 2026 / 2 << "\n";
    // 割り算: 1013

    std::cout << (2020 + 6) / 2 << "\n";    // 202
    std::cout << (2020 + 5) / 10.0 << "\n"; // 202.5

    std::cout << (2020 + 6) % 3 << "\n"; // 1
    std::cout << (2020 + 7) % 3 << "\n"; // 2
    std::cout << (2020 + 8) % 3 << "\n"; // 0
    std::cout << (2020 + 9) % 3 << "\n"; // 1

    return 0;
}